// Задача 5.Дефинирайте едномерен масив int с 10 елемента =
// {
// Дефинирайте пойнтер, който ще сочи към масива.
// Достъпете 3 тия елемент от масива и му задайте стойност 5.
// Достъпете 4 тия елемент и му задайте стойност 33.
// Достъпете 5 тия елемент и го намалете със 7.
// Достъпете 7 мия елемент и го увеличете с 10.
// Достъпете 10 тия елемент и го умножете по 3.
// Изпишете го по двата възможни начина и закоментирайте единия.
// Принтирайте на екрана всички елементи на масива.

#include<stdio.h>
#define SIZE 10
int main()
{   
    int arr[SIZE]={100, 90, 80, 70, 60, 50, 40, 30, 20, 10};
    int i;
    int *pntr=arr;
  

    *(pntr + 2)= 5;
    *(pntr + 3)= 33;
    *(pntr + 4)-= 7;
    *(pntr + 6)+= 10;
    *(pntr + 9)*= 3;
    for ( i = 0; i < SIZE; i++)
    {
        printf("%d\t", arr[i]);
    }
    



    return 0;
}